Tekla Open API Reference for Tekla Structures 2025
AnalysisObjectEnumerator Properties
The AnalysisObjectEnumerator type exposes the following members.
Properties
Name | Description
Current
 Gets the current analysis object in the enumerator.
CurrentItem
 Gets or sets the index of the current item.
CurrentSelected
 Gets or sets the currently selected item.
SelectInstances
 Gets or sets a value indicating whether the instance's Select() is called when the "Current" item is asked from the enumerator. The user can set this to "false" if no members are ever asked from the instance. This is the case when e.g. asking only a report property from this identifier. WARNING: normally the user should not change this value.
Top
See Also
Reference
AnalysisObjectEnumerator Class
Tekla.Structures.Analysis Namespace